frontend/modules/school/views/duty-rota/_form.php


    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'teacher')->dropDownList(ArrayHelper::map(User::find()->where(['user_type'=>'Teacher'])->all(), 'id', 'firstname'), ['prompt'=>'Select Teacher']) ?>
---
SELECT * FROM `user` WHERE `user_type`='Teacher'


    <?= $form->field($model, 'end_date')->textInput(['type'=>'date']) ?>

    <?= $form->field($model, 'session')->dropDownList(ArrayHelper::map(AcademicSessions::find()->all(), 'session_id', 'session_title')) ?>
---
SELECT * FROM `academic_sessions`