frontend/modules/school/views/students/index.php

        <span class="pull-right">
            <a class="btn btn-success details" href="<?= Url::to(['/school/students/create']) ?>">New Student</a>
            <a class="btn btn-warning" href="<?= Url::to(['/school/parents']) ?>">Parents</a>
        	<?php foreach (Classes::find()->all() as $class) { ?>
---
SELECT * FROM `classes`