frontend/modules/school/views/teacher/index.php

SELECT * FROM `user` WHERE `user_type`='Teacher'
---
                            </tr>
                        </tfoot>
                        <tbody>
                            <?php $i=1; foreach (User::find()->where(['user_type'=>'Teacher'])->all() as $teacher){ ?>