frontend/controllers/SiteController.php

SELECT SUM(remaining_sms) FROM `subscriptions` WHERE `owner`=1
SELECT * FROM `events_calendar`
---
    public function actionIndex()
    {
        if (!Yii::$app->user->isGuest) {
            if (Yii::$app->user->identity->user_type != "Superadmin"){
                $check = Subscriptions::find()->where(['owner'=>Yii::$app->user->identity->id])->sum('remaining_sms');
                if ($check<1) {
                    $this->layout = "signup";
                    return $this->render('subscriptions');
                }
            }
            $events = [];
            $times = EventsCalendar::find()->all();