common/models/Messages.php

SELECT * FROM `subscriptions` WHERE (`owner`=1) AND (`remaining_sms` > 0) ORDER BY `sub_id` DESC
---
    public static function sendMessage($to, $text){
        $check = Subscriptions::find()->where(['owner'=>\Yii::$app->user->identity->id])->andWhere(['>', 'remaining_sms', 0])->orderBy(['sub_id'=>SORT_DESC])->one();