frontend/modules/school/controllers/DutyRotaController.php

SELECT * FROM `duty_rota`
---
    public function actionIndex()
    {
        $model = DutyRota::find()->all();

SELECT * FROM `duty_rota` WHERE `duty_id`='1'
---
    protected function findModel($id)
    {
        if (($model = DutyRota::findOne($id)) !== null) {