frontend/modules/school/controllers/StudentsController.php

    public function actionIndex($class_id=null)
    {
        if ($class_id) {
            $students = Students::find()->where(['class'=>$class_id])->with('parent0')->with('class0')->with('stream0')->all();
        }else {
            $students = Students::find()->with('parent0')->with('class0')->with('stream0')->all();
---
SELECT * FROM `classes` WHERE `class_id`=1
SELECT * FROM `students`