frontend/modules/account/views/subscriptions/_form.php

SELECT * FROM `user` WHERE (`user_type`='Superadmin') OR (`user_type`='Organization')
---

    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'owner')->dropDownList(ArrayHelper::map(User::find()->where(['user_type'=>'Superadmin'])->orWhere(['user_type'=>'Organization'])->all(), 'id', 'organization'), ['prompt'=>'Select Organization'])->label(false) ?>