frontend/modules/account/views/subscriptions/clients.php

SELECT SUM(amount) FROM `subscriptions` WHERE `owner` IN (1, 'Superadmin', 'Merc Sky Africa', 'Samuel', 'Machira', '0704400725', 'zOKsERzbKhUegmJWLGLorcvJ545uFKl9', '$2y$13$f12Sok0VkX5wd4vPwdoFk.5GoSpxaegwAo.cYnFSRrrfCR33ctXRS', NULL, 'maithyakavyu@outlook.com', 10, 'Superadmin', 1550741771, 1553117964)
SELECT SUM(sms_quantity) FROM `subscriptions` WHERE `owner` IN (1, 'Superadmin', 'Merc Sky Africa', 'Samuel', 'Machira', '0704400725', 'zOKsERzbKhUegmJWLGLorcvJ545uFKl9', '$2y$13$f12Sok0VkX5wd4vPwdoFk.5GoSpxaegwAo.cYnFSRrrfCR33ctXRS', NULL, 'maithyakavyu@outlook.com', 10, 'Superadmin', 1550741771, 1553117964)
SELECT SUM(used_sms) FROM `subscriptions` WHERE `owner` IN (1, 'Superadmin', 'Merc Sky Africa', 'Samuel', 'Machira', '0704400725', 'zOKsERzbKhUegmJWLGLorcvJ545uFKl9', '$2y$13$f12Sok0VkX5wd4vPwdoFk.5GoSpxaegwAo.cYnFSRrrfCR33ctXRS', NULL, 'maithyakavyu@outlook.com', 10, 'Superadmin', 1550741771, 1553117964)
SELECT SUM(remaining_sms) FROM `subscriptions` WHERE `owner` IN (1, 'Superadmin', 'Merc Sky Africa', 'Samuel', 'Machira', '0704400725', 'zOKsERzbKhUegmJWLGLorcvJ545uFKl9', '$2y$13$f12Sok0VkX5wd4vPwdoFk.5GoSpxaegwAo.cYnFSRrrfCR33ctXRS', NULL, 'maithyakavyu@outlook.com', 10, 'Superadmin', 1550741771, 1553117964)
---
                                <td><?= $client['organization']  ?></td>
                                <td><?= $client['phone'] ?></td>
                                <td><?= $client['email'] ?></td>
                                <td class="text-info"><?= number_format(Subscriptions::find()->where(['owner'=>$client])->sum('amount'), 2) ?></td>
                                <td class="text-success"><?= number_format(Subscriptions::find()->where(['owner'=>$client])->sum('sms_quantity'), 2) ?></td>
                                <td class="text-danger"><?= number_format(Subscriptions::find()->where(['owner'=>$client])->sum('used_sms'), 2) ?></td>
                                <td class="text-warning"><?= number_format(Subscriptions::find()->where(['owner'=>$client])->sum('remaining_sms'), 2) ?></td>