frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->user_type = "Organization";
        $user->organization = $this->organization;
        $user->username = $this->username;
        $user->email = $this->email;
        $user->firstname = $this->organization;
        $user->lastname = $this->organization;
        $user->phone = $this->phone;
        $user->status = 0;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;
---
INSERT INTO `user` (`user_type`, `organization`, `username`, `email`, `firstname`, `lastname`, `phone`, `status`, `password_hash`, `auth_key`, `created_at`, `updated_at`) VALUES ('Organization', 'Technolust', 'solomon', 'maithyaknife@gmail.com', 'Technolust', 'Technolust', '0704400725', 0, '$2y$13$BrT3cnj6X7cGO080/vOtL.DhgDTtCRhDz9h3aD1.IuFVz11Og0syi', 'zux8n-s6MTnLvdijp0vF4l3Wq1HOhU_1', 1557253427, 1557253427)