frontend/modules/account/controllers/SubscriptionsController.php

    public function actionClients()
    {
        $clients = User::find()->where(['user_type'=>'Superadmin'])->orWhere(['user_type'=>'Organization'])->all();
---
SELECT * FROM `user` WHERE (`user_type`='Superadmin') OR (`user_type`='Organization')