frontend/modules/communications/controllers/MessagesController.php

    public function actionIndex()
    {
        $model = Messages::find()->all();
---
SELECT * FROM `messages`

    public function actionQuick($id=null)
    {
        $model = new Messages();
        if ($id) {
            $user = User::findOne($id);
            $model->recipient = $user->phone;
            $model->message = "Hello ". $user->organization.", Please renew your SMS subscription to avoid disconnection";
        }else {
            $model->recipient = "+254";
        }

        if ($model->load(Yii::$app->request->post())) {
            $message = Messages::sendMessage($model->recipient, $model->message);
            if ($message) {
                $text = new Messages();
                $text->sender = Yii::$app->user->identity->id;
                $text->recipient = $model->recipient;
                $text->message = $model->message;
                $text->title = "Individual SMS";
                $text->status = 1;
                $text->save();
---
SELECT * FROM `user` WHERE `id`='7'
INSERT INTO `messages` (`sender`, `recipient`, `message`, `title`, `status`) VALUES (1, '+254704400725', 'Hello Migwani Secondary School, Please renew your SMS subscription to avoid disconnection', 'Individual SMS', 1)