frontend/views/site/index.php

                    <div class="col-7">
                        <div class="numbers">
                            <p class="card-category">SMS Used</p>
                            <h4 class="card-title"><?= Messages::find()->where(['sender'=>Yii::$app->user->identity->id])->count() ?></h4>
---
SELECT COUNT(*) FROM `messages` WHERE `sender`=1

                    <div class="col-7">
                        <div class="numbers">
                            <p class="card-category">SMS Balance</p>
                            <h4 class="card-title"><?= Subscriptions::find()->where(['owner'=>Yii::$app->user->identity->id])->one() ? Subscriptions::find()->where(['owner'=>Yii::$app->user->identity->id])->one()->remaining_sms : 0 ?></h4>
---
SELECT * FROM `subscriptions` WHERE `owner`=1

                    <div class="col-7">
                        <div class="numbers">
                            <p class="card-category">Total Students</p>
                            <h4 class="card-title"><?= Students::find()->count() ?></h4>
---
SELECT COUNT(*) FROM `students`

                    <div class="col-7">
                        <div class="numbers">
                            <p class="card-category">Contacts</p>
                            <h4 class="card-title"><?= Parents::find()->count() ?></h4>
---
SELECT COUNT(*) FROM `parents`